app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
	@movies=Movie.all
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 5)
SELECT * FROM `movies`

  def list

  @movie= Movie.all
  @rooms=Room.find(params[:id])
  @room=Room.all
---
SELECT * FROM `movies` WHERE (`movies`.room_id = 4)
SELECT * FROM `rooms` WHERE (`rooms`.`id` = '--- :id\n')
SELECT * FROM `rooms`

  def edit
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`duration`, `room_id`, `created_at`, `photo_file_size`, `title`, `updated_at`, `photo_file_name`, `time`, `photo_content_type`, `date`) VALUES(90, 1, '2009-09-30 19:31:03', 4542, 'Matrix', '2009-09-30 19:31:03', 'images.jpeg', '2009-09-30 21:30:00', 'image/jpeg', '2009-09-30')

  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 2)
UPDATE `movies` SET `updated_at` = '2009-09-30 19:42:39', `photo_file_name` = 'images.jpeg', `photo_file_size` = 4542, `photo_content_type` = 'image/jpeg' WHERE `id` = 5

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 4)
DELETE FROM `movies` WHERE `id` = 4