app/controllers/rooms_controller.rb

  def edit
    @room = Room.find(params[:id])
---
SELECT * FROM `rooms` WHERE (`rooms`.`id` = 1)

  def create
    @room = Room.new(params[:room])

    respond_to do |format|
      if @room.save
---
INSERT INTO `rooms` (`name`, `created_at`, `updated_at`) VALUES('Room nr 1', '2009-09-30 19:19:46', '2009-09-30 19:19:46')

  def update
    @room = Room.find(params[:id])

    respond_to do |format|
      if @room.update_attributes(params[:room])
---
SELECT * FROM `rooms` WHERE (`rooms`.`id` = 4)
UPDATE `rooms` SET `updated_at` = '2009-09-30 19:22:24', `name` = 'Room nr 3' WHERE `id` = 1

  def destroy
    @room = Room.find(params[:id])
---
SELECT * FROM `rooms` WHERE (`rooms`.`id` = 10)